Repository: defaultroot-ai/cabinete
Catalog: languages/medical-booking-system-*.po
Languages: ro_ro

source: Medical Booking System
ro_ro: Sistem Programări Medicale

source: Complete medical appointment booking system with multilingual support, calendar management, and patient management.
ro_ro: Sistem complet de programări medicale cu suport multilingv, gestionare calendar și management pacienți.

source: Loading...
ro_ro: Se încarcă...

source: An error occurred. Please try again.
ro_ro: A apărut o eroare. Te rugăm să încerci din nou.

source: Success!
ro_ro: Succes!

source: Confirm Booking
ro_ro: Confirmă Programarea

source: Cancel Booking
ro_ro: Anulează Programarea

source: Select Service
ro_ro: Selectează Serviciul

source: Select Doctor
ro_ro: Selectează Medicul

source: Select Date
ro_ro: Selectează Data

source: Select Time
ro_ro: Selectează Ora

source: Select Patient
ro_ro: Selectează Pacientul

source: Booking Summary
ro_ro: Rezumat Programare

source: Confirmation
ro_ro: Confirmare

source: Are you sure you want to delete this item?
ro_ro: Ești sigur că vrei să ștergi acest element?

source: Saving...
ro_ro: Se salvează...

source: Saved successfully!
ro_ro: Salvat cu succes!

source: Error saving. Please try again.
ro_ro: Eroare la salvare. Te rugăm să încerci din nou.

source: Medical Clinic
ro_ro: Clinica Medicală

source: Appointment Confirmation
ro_ro: Confirmare Programare

source: Appointment Reminder
ro_ro: Reminder Programare

source: Appointment Cancelled
ro_ro: Programare Anulată
